{
    "home": "Startseite",
    "about": "Über mich",
    "projects": "Projekte",
    "downloadCv": "Lebenslauf herunterladen",
    "contact": "Kontakt",
    "more": "Mehr...",
    "aboutText":"Ich habe 2010 meinen Bachelor-Abschluss in Computer Systems gemacht. Ich arbeitete vier Jahre lang als Technischer Support-Mitarbeiter in Syrien, bevor ich emigrierte. Ich habe eine Leidenschaft für Programmierung und habe an der Universität mehrere Programmiersprachen gelernt, darunter C, C++, C# und Java. Nach meinem Umzug nach Deutschland habe ich Kurse in Webentwicklung und Java-Entwicklung besucht. Jetzt kann ich mich als Junior MERN-Stack / Java-Softwareentwickler beschreiben.",
    "getToKnow":"Lernen Sie mich kennen!",
    "getToKnowMeText": "Hallo! Ich bin <strong>Alan Miste/Hassan</strong> ein <strong> Full-Stack Webentwickler </strong>/<strong> Java-Softwareentwickler</strong>. Während meiner <strong>(Weiterbildung)</strong> in der <strong>  Webentwicklung und Java-Softwareentwicklung </strong>habe ich mehrere Projekte als Übung abgeschlossen, bei denen sowohl <strong>front-end</strong> als auch <strong>back-end</strong> Webentwicklungstechniken verwendet wurden.</p> <p class='about__content-details-para'> Ich bin ein kleiner Technikfreak und habe im Laufe der Jahre Hunderte von Web- und mobilen Apps benutzt. Ich habe eine Leidenschaft für Programmierung und Codierung. Außerdem habe ich Hobbys im Bereich Design und Fotobearbeitung sowie einige andere Hobbys außerhalb des technischen Bereichs. Ich interessiere mich auch für Astronomie. Zögern Sie nicht, mich hier zu <strong>kontaktieren</strong>.",
    "mySkills": "Meine Fähigkeiten",
    "projectsText": "Dies sind einige meiner Projekte, an denen ich gearbeitet habe, um meine Erfahrungen zu erweitern.",
    "SpaceGeeksCornerHome": "Es ist eine Anwendung, die das Anzeigen verschiedener Bilder ermöglicht, die über die API von der NASA abgerufen werden. Der eingeloggte Benutzer kann Fotos zu seinen Favoriten hinzufügen oder löschen, wenn er sie nicht mehr möchte. Er kann auch T-Shirt-Mockups aus den Fotos erstellen, die ihm gefallen, und das mit nur einem Klick!",
    "reduxShoppingCartHome": "Der Redux Shopping Cart ist eine einfache Web-App, die ich erstellt habe, um das Gelernte über das Redux Toolkit anzuwenden.",
    "amBlogHome": "AM Blog ist eine einfache Blogseite, die aus einer 'Blogs'-Seite zur Anzeige aller Beiträge, einer 'Über'-Seite und einer 'Neuer Blog'-Seite besteht, auf der neue Beiträge hinzugefügt werden können, wenn der Benutzer eingeloggt ist. Ich habe einfache Anmelde- und Registrierungsseiten erstellt und zur Authentifizierung JWT (JSON Web Tokens) verwendet. Der eingeloggte Benutzer kann seine eigenen Blogs einzeln löschen.",
    "todoJavaAppHome": "Die Todo-App ist eine einfache Anwendung, die aus einem Feld zum Eingeben von Aufgaben und drei Abschnitten für jeden Status besteht: Offen, In Bearbeitung und Erledigt. Zusätzlich gibt es eine Navigationsleiste.",
    "cookbookHome": "Eine Kochbuch-Website ist eine einfache Seite zur Anzeige von Kochrezepten. Ich habe sie vollständig selbst programmiert (Front-End und Back-End).",
    "todoListHome": "Todo-Listen-App zum Schreiben täglicher Aufgaben. Verwenden Sie Ihren Browser, um Ihre täglichen Aufgaben anstelle von Stift und Papier zu erfassen.",
    "emailMeText": "Schreiben Sie mir gerne eine E-Mail!",
    "clickToCopy": "Zum Kopieren klicken",
    "defualtEmailApp": "Standard E-Mail-App öffnen",
    "javaMernFooter": "Java-Software / MERN-Stack-Entwickler",
    "followMe": "Folgen Sie mir auf:",
    "projectOverview": "Projektübersicht",
    "projectOverviewText": "<p class='project-details__desc-para'><strong>Warum?</strong><br />In meiner Freizeit entwerfe ich Fotos, und manchmal dauert das Designen lange, daher wünschte ich mir immer, es wäre einfacher. So entstand die Idee, eine Anwendung zu erstellen, die Designs mit den geringstmöglichen Schritten erstellt, und ich denke, weniger als ein Klick ist nicht möglich. Da ich ein Weltraum-Fan bin, konnte ich kein besseres Thema als Weltraumbilder finden, um der Held dieser App zu sein.</p><p class='project-details__desc-para'><strong>Was?!</strong><br />Es ist eine Anwendung, die das Anzeigen verschiedener Bilder ermöglicht, die über die API von der NASA abgerufen werden. Der eingeloggte Benutzer kann Fotos zu seinen Favoriten hinzufügen oder löschen, wenn er sie nicht mehr möchte. Er kann auch T-Shirt-Mockups aus den Fotos erstellen, die ihm gefallen, und das mit nur einem Klick!</p><p class='project-details__desc-para'><strong>Wie?!</strong><br />Mit den folgenden Techniken konnte ich diese Anwendung erstellen:</p>",
    "toolsUsed": "Verwendete Technologien",
    "seeLive": "Live ansehen",
    "seeLiveText": "Zunächst habe ich das Projekt auf Herokus kostenlosem Hosting-Plan bereitgestellt. Allerdings wurde der kostenlose Plan vor Kurzem eingestellt. Als Reaktion auf die Benachrichtigung über die Einstellung des kostenlosen Plans habe ich ein Präsentationsvideo erstellt, das die Funktionalität und das Erscheinungsbild der App zeigt.<br />Dieses Video dient als vorübergehende Lösung, damit Besucher die App schnell sehen und erleben können, ohne das Repository zu klonen oder Bibliotheken zu installieren.",
    "goToVideo": "Zum Video gehen"
}
